/*****************************************************************************                               *
*                                                                            *
*  @file     Example.h                                                       *
*  @brief    对文件的简述                                                      *
*  Details.                                                                  *
*                                                                            *
*  @author   Henry.Wen                                                       *
*  @email    renhuabest@163.com                                              *
*  @version  1.0.0.1(版本号)                                                  *
*  @date     renhuabest@163.com                                              *
*  @license  GNU General Public License (GPL)                                *
*                                                                            *
*----------------------------------------------------------------------------*
*  Remark         : Description                                              *
*----------------------------------------------------------------------------*
*  Change History :                                                          *
*  <Date>      <Version> | <Author>       | <Description>                   *
*----------------------------------------------------------------------------*
*  2014/01/24 | 1.0.0.1   | Henry.Wen      | Create file                     *
*----------------------------------------------------------------------------*
*                                                                            *
*****************************************************************************/
/**
* @brief 一个测试的枚举
*
*枚举的详细说明
*/	
enum 
{
	e_t1,
	e_t2,
	
};

/** 
* @brief 一个测试程序声明
*
*用于测试doxygen的注释功能
* @param index    
* @param t            
*
* @return 
*        -<em>false</em> fail
*        -<em>true</em> succeed
*/
void test()
{

}



